12/data/attachments/f8ce8fd8a2ac07c3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_9f76c398-7c39-40ef-b00f-6aba22c179e9</nif:username>
            <nif:friendToBeAdded>Jennifer_true_Actions_33028_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>